{
   "count":1,
   "values":[
      {
         "id":1,
         "user_id":1,
         "place":{
            "id":4089,
            "name":"Toronto",
            "description":null,
            "long_name":"Toronto - Ontario - Canada",
            "type":{
               "id":6,
               "name":"City"
            },
            "popularity":3.0,
            "rating":3.0,
            "hoursOfVisit":2.0,
            "latitude":0.0,
            "longitude":0.0,
            "photoUrls":[

            ]
         },
         "length_in_days":3,
         "pace":{
            "id":2,
            "name":"regular",
            "capacity":7.5
         },
         "destinations":[
            [
               {
                  "id":1,
                  "poi":{
                     "id":503129,
                     "name":"Art Gallery of Ontario",
                     "description":"The Art Gallery of Ontario(AGO) bring art and people together and boldly declare that Art Matters.\nAGO is an art museum in Toronto's Downtown Grange Park district, on Dundas Street West between McCaul Street and Beverley Street. Our collection includes more than 80,000 works spanning the 1st century to the present-day. The gallery has 45,000 square metres (480,000 sq ft) of physical space, making it one of the largest galleries in North America.\nSignificant collections include the largest collection of Canadian art, an expansive body of works from the Renaissance and the Baroque eras, European art, African and Oceanic art, and a modern and contemporary collection. The photography collection is a large part of the collection, as well as an extensive drawing and prints collection. The museum contains many significant sculptures, such as in the Henry Moore sculpture centre, and represents other forms of art like historic objects, miniatures, frames, books and medieval illuminations, film and video art, graphic art, installations, architecture, and ship models.\nDuring the AGO's history, it has hosted and organized some of the world's most renowned and significant exhibitions, and continues to do so, to this day.\nOver the last three decades, the gallery has seen four major expansions and renovations, typically considered a high amount and unseen by most galleries of the world, and continues to add spaces today.",
                     "long_name":"Art Gallery of Ontario - Ontario - Canada",
                     "type":{
                        "id":100,
                        "name":"poi"
                     },
                     "popularity":84.25,
                     "rating":4.7,
                     "hoursOfVisit":2.0,
                     "latitude":43.653611,
                     "longitude":-79.394701,
                     "photoUrls":[

                     ]
                  },
                  "trip_id":1,
                  "day":1,
                  "order":0,
                  "destination_trip_map_id":1
               },
               {
                  "id":2,
                  "poi":{
                     "id":6245251,
                     "name":"Art Gallery of Toronto",
                     "description":"878,478 (2009-10)[1]",
                     "long_name":"Art Gallery of Toronto - Ontario - Canada",
                     "type":{
                        "id":100,
                        "name":"poi"
                     },
                     "popularity":3.0,
                     "rating":3.0,
                     "hoursOfVisit":2.0,
                     "latitude":43.0,
                     "longitude":-79.0,
                     "photoUrls":[

                     ]
                  },
                  "trip_id":1,
                  "day":1,
                  "order":1,
                  "destination_trip_map_id":2
               },
               {
                  "id":3,
                  "poi":{
                     "id":6125818,
                     "name":"Ashbridge's Bay Park",
                     "description":"Ashbridge's Bay is a bay and park that was once part of the marsh that lay east of Toronto Islands and Toronto Harbour. It is located along Lake Shore Boulevard next to Woodbine Beach in the Beaches. The Martin Goodman Trail and boardwalk run through the park along the bay. The boardwalk runs 3 kilometres from Ashbridge's Bay in the west to the R. C. Harris Water Treatment Plant in the east along Lake Ontario.",
                     "long_name":"Ashbridge's Bay Park - Ontario - Canada",
                     "type":{
                        "id":100,
                        "name":"poi"
                     },
                     "popularity":3.0,
                     "rating":3.0,
                     "hoursOfVisit":2.0,
                     "latitude":43.0,
                     "longitude":-79.0,
                     "photoUrls":[

                     ]
                  },
                  "trip_id":1,
                  "day":1,
                  "order":2,
                  "destination_trip_map_id":3
               }
            ],
            [
               {
                  "id":4,
                  "poi":{
                     "id":6072473,
                     "name":"Bata Shoe Museum",
                     "description":"Discover the treasures of North America's charming and surprising shoe museum. Hundreds of shoes (from a collection numbering over 10,000) are on exhibit in architect Raymond Moriyama's award-winning four-storey structure.\n\nThe Museum celebrates the style and function of footwear in four impressive galleries. Footwear on display ranges from Chinese bound foot shoes and ancient Egyptian sandals to chestnut-crushing clogs and glamourous platforms. Over 4,500 years of history and a collection of 20th-century celebrity shoes are reflected in the semi-permanent exhibition, All About Shoes. Three other galleries feature changing exhibitions, so there's always something new to see.",
                     "long_name":"Bata Shoe Museum - Ontario - Canada",
                     "type":{
                        "id":100,
                        "name":"poi"
                     },
                     "popularity":84.0,
                     "rating":4.4,
                     "hoursOfVisit":1.5,
                     "latitude":43.667243,
                     "longitude":-79.400166,
                     "photoUrls":[

                     ]
                  },
                  "trip_id":1,
                  "day":2,
                  "order":0,
                  "destination_trip_map_id":4
               },
               {
                  "id":5,
                  "poi":{
                     "id":6228058,
                     "name":"Baycrest Arena",
                     "description":null,
                     "long_name":"Baycrest Arena - Ontario - Canada",
                     "type":{
                        "id":100,
                        "name":"poi"
                     },
                     "popularity":3.0,
                     "rating":3.0,
                     "hoursOfVisit":2.0,
                     "latitude":43.0,
                     "longitude":-79.0,
                     "photoUrls":[

                     ]
                  },
                  "trip_id":1,
                  "day":2,
                  "order":1,
                  "destination_trip_map_id":5
               },
               {
                  "id":6,
                  "poi":{
                     "id":6228022,
                     "name":"Bayview Village Shopping Centre",
                     "description":"Bayview Village Shopping Centre is a shopping mall in the North York area of Toronto, Ontario, Canada, containing over 110 stores. The 440,000-square-foot (41,000Â m2) shopping mall is located at Bayview Avenue and Sheppard Avenue in the community of Willowdale, and neighbourhood of Bayview Village.",
                     "long_name":"Bayview Village Shopping Centre - Ontario - Canada",
                     "type":{
                        "id":100,
                        "name":"poi"
                     },
                     "popularity":3.0,
                     "rating":3.0,
                     "hoursOfVisit":2.0,
                     "latitude":43.0,
                     "longitude":-79.0,
                     "photoUrls":[

                     ]
                  },
                  "trip_id":1,
                  "day":2,
                  "order":2,
                  "destination_trip_map_id":6
               }
            ],
            [
               {
                  "id":7,
                  "poi":{
                     "id":6198222,
                     "name":"Birchmount Park",
                     "description":"Clairlea is a neighbourhood of Scarborough, in the city of Toronto, Ontario, Canada. The neighbourhood is located in the western part of Scarborough just east of Victoria Park Avenue. To the north it is bounded by Eglinton Avenue and to the south by Taylor-Massey Creek and the railway tracks.",
                     "long_name":"Birchmount Park - Ontario - Canada",
                     "type":{
                        "id":100,
                        "name":"poi"
                     },
                     "popularity":3.0,
                     "rating":3.0,
                     "hoursOfVisit":2.0,
                     "latitude":43.0,
                     "longitude":-79.0,
                     "photoUrls":[

                     ]
                  },
                  "trip_id":1,
                  "day":3,
                  "order":0,
                  "destination_trip_map_id":7
               },
               {
                  "id":8,
                  "poi":{
                     "id":503125,
                     "name":"Black Creek Pioneer Village",
                     "description":"Black Creek Pioneer Village is more than a collection of buildings and artifacts. Here, you will become immersed in the lifestyles, customs, and surroundings of early residents who built the foundations for modern Toronto and Ontario at the typical crossroads community village found in the Toronto area during the 1800's.",
                     "long_name":"Black Creek Pioneer Village - Ontario - Canada",
                     "type":{
                        "id":100,
                        "name":"poi"
                     },
                     "popularity":69.83,
                     "rating":4.3,
                     "hoursOfVisit":1.5,
                     "latitude":43.773373,
                     "longitude":-79.519123,
                     "photoUrls":[

                     ]
                  },
                  "trip_id":1,
                  "day":3,
                  "order":1,
                  "destination_trip_map_id":8
               },
               {
                  "id":9,
                  "poi":{
                     "id":6202176,
                     "name":"Bluffer's Park",
                     "description":"The Scarborough Bluffs, also known as The Bluffs, are an escarpment in the Scarborough district of Toronto, Ontario, Canada. Forming much of the eastern portion of Toronto's waterfront, it is located along the shoreline of Lake Ontario. At its highest point, the escarpment rises 90 metres (300Â ft) above the coastline and spans a length of 15 kilometres (9.3Â mi). It was first named in 1793.",
                     "long_name":"Bluffer's Park - Ontario - Canada",
                     "type":{
                        "id":100,
                        "name":"poi"
                     },
                     "popularity":3.0,
                     "rating":3.0,
                     "hoursOfVisit":2.0,
                     "latitude":43.0,
                     "longitude":-79.0,
                     "photoUrls":[

                     ]
                  },
                  "trip_id":1,
                  "day":3,
                  "order":2,
                  "destination_trip_map_id":9
               }
            ]
         ]
      }
   ]
}
